app/services/users/change_email.rb

SELECT "users".* FROM "users" WHERE "users"."reset_email_token" = $1 LIMIT $2  [["reset_email_token", "318621194f64d65a9699"], ["LIMIT", 1]]
---
    def user
      @user ||= User.find_by(reset_email_token: (params[:token].to_s))