app/services/passwords/create.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "agustin@setaworkshop.com"], ["LIMIT", 1]]
---
    def user
      @user ||= User.find_by(email: params[:email])