app/services/passwords/update.rb

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "d282cbe03cd2cfd4f53e"], ["LIMIT", 1]]
---
    def user
      @user ||= User.find_by(reset_password_token: params[:token])