app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at", "username", "password_digest", "reset_password_token", "reset_password_sent_at", "unconfirmed_email", "reset_email_token", "reset_email_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"