app/models/user.rb

  def self.email_used?(email)
    existing_user = find_by("email = ?", email)

    if existing_user.present?
---
SELECT "users".* FROM "users" WHERE (unconfirmed_email = 'new@gmail.com') LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "test@test.com"], ["id", 2], ["LIMIT", 1]]